; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	satellite6 - satellite
	instrument13 - instrument
	thermograph2 - mode
	image4 - mode
	thermograph0 - mode
	infrared1 - mode
	image3 - mode
	GroundStation1 - direction
	GroundStation0 - direction
	Star3 - direction
	Star2 - direction
	GroundStation5 - direction
	Star4 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star4)
	(supports instrument1 thermograph2)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star3)
	(supports instrument2 image4)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star6)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star6)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument5 image4)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 Star6)
	(supports instrument6 infrared1)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star2)
	(supports instrument7 thermograph0)
	(supports instrument7 infrared1)
	(calibration_target instrument7 GroundStation0)
	(calibration_target instrument7 Star4)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument8 image4)
	(calibration_target instrument8 GroundStation5)
	(calibration_target instrument8 Star3)
	(supports instrument9 image4)
	(calibration_target instrument9 Star2)
	(supports instrument10 infrared1)
	(supports instrument10 thermograph0)
	(supports instrument10 thermograph2)
	(calibration_target instrument10 GroundStation5)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star12)
	(supports instrument11 thermograph2)
	(supports instrument11 infrared1)
	(calibration_target instrument11 Star6)
	(calibration_target instrument11 GroundStation5)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon7)
	(supports instrument12 thermograph0)
	(supports instrument12 thermograph2)
	(calibration_target instrument12 Star4)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star4)
	(supports instrument13 thermograph0)
	(calibration_target instrument13 Star6)
	(on_board instrument13 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star4)
)
(:goal (and
	(pointing satellite1 GroundStation0)
	(pointing satellite4 GroundStation0)
	(pointing satellite5 Phenomenon11)
	(pointing satellite6 Phenomenon10)
	(have_image Phenomenon7 image3)
	(have_image Phenomenon8 thermograph0)
	(have_image Star9 thermograph0)
	(have_image Phenomenon10 image3)
	(have_image Phenomenon11 image3)
	(have_image Star12 image4)
))

)

; plan
1. (turn_to satellite6 phenomenon10 star4)
   deleted: (pointing satellite6 star4)
   added: (pointing satellite6 phenomenon10)
   goals met: 1 of 10
2. (switch_on instrument12 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument12)
   goals met: 1 of 10
3. (calibrate satellite5 instrument12 star4)
   added: (calibrated instrument12)
   goals met: 1 of 10
4. (turn_to satellite5 phenomenon8 star4)
   deleted: (pointing satellite5 star4)
   added: (pointing satellite5 phenomenon8)
   goals met: 1 of 10
5. (turn_to satellite4 groundstation0 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 groundstation0)
   goals met: 2 of 10
6. (turn_to satellite1 groundstation0 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 groundstation0)
   goals met: 3 of 10
7. (turn_to satellite0 groundstation0 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation0)
   goals met: 3 of 10
8. (take_image satellite5 phenomenon8 instrument12 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 4 of 10
9. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 10
10. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 4 of 10
11. (turn_to satellite0 phenomenon10 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 10
12. (take_image satellite0 phenomenon10 instrument2 image3)
   added: (have_image phenomenon10 image3)
   goals met: 5 of 10
13. (turn_to satellite0 phenomenon11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 10
14. (take_image satellite0 phenomenon11 instrument2 image3)
   added: (have_image phenomenon11 image3)
   goals met: 6 of 10
15. (turn_to satellite0 phenomenon7 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon7)
   goals met: 6 of 10
16. (take_image satellite0 phenomenon7 instrument2 image3)
   added: (have_image phenomenon7 image3)
   goals met: 7 of 10
17. (turn_to satellite0 star12 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star12)
   goals met: 7 of 10
18. (take_image satellite0 star12 instrument2 image4)
   added: (have_image star12 image4)
   goals met: 8 of 10
19. (turn_to satellite5 star9 phenomenon8)
   deleted: (pointing satellite5 phenomenon8)
   added: (pointing satellite5 star9)
   goals met: 8 of 10
20. (take_image satellite5 star9 instrument12 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 9 of 10
21. (turn_to satellite5 phenomenon11 star9)
   deleted: (pointing satellite5 star9)
   added: (pointing satellite5 phenomenon11)
   goals met: 10 of 10
